/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_next_line.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: saeryu <@student.42berlin.de>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/05 15:47:09 by saeryu            #+#    #+#             */
/*   Updated: 2024/01/05 16:04:41 by saeryu           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "get_next_line.h"

char	*get_next_line(int fd)
{
	static t_list	*head;
	char			*res;

	if (fd <= 0)
		return (NULL);
}

/*
	/// fd 확인하기
	/// 1. 버퍼사이즈만큼 읽고 저장하기
	/// 2. 남은 글자가 있는지 확인하고, 있다면 head에 저장하기
	/// 3. 링크드 리스트를 free, del
	/// 완전히 텍스트가 끝났다면 NULL 반환하기
	/// 엣지 케이스 확인하기
*/